Revit 2026 API

# PrintManagerSubmitPrint(View) Method

---

Print a view with the current PrintManager settings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SubmitPrint(
	View view
)
```
```vb
Public Function SubmitPrint (
	view As View
) As Boolean
```
```cpp
public:
bool SubmitPrint(
	View^ view
)
```
```fsharp
member SubmitPrint :
        view : View -> bool
```

#### Parameters

view View
    The User-assigned view.

#### Return Value

BooleanTrue if successful, otherwise False.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when this operation is not allowed in the current application mode, or the print resource is occupied by others. |

PrintManager will apply the local settings to global and print the user-assigned view with the current settings.

#### Reference

PrintManager Class

SubmitPrint Overload

Autodesk.Revit.DB Namespace